---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.ElectricalSetting
source: html/f082b834-54e0-3200-fc46-8fd9b22ba147.htm
---
# ElectricalSetting Properties

The id of the assembly instance to which the element belongs.